https://github.com/okovtun/BV_319.git
https://www.youtube.com/playlist?list=PLeqyOOqxeiIMAsBCAT2iL0nEHONChw0yJ

TODO:
https://www.intel.com/content/www/us/en/support/articles/000059657/processors/intel-xeon-processors.html?wapkw=xeon%20gold%206246(r)
Собрать сервер

TODO:
В проекте 'FOR' решить следующие задачи:
1. С клавиатуры вводится число, и программа вычисляет факториал этого числа.
   Факториал - это произведение ряда чисел от 1 до указанного, например:
	5! = 1*2*3*4*5 = 120;
2. С клавиатуры вводится основание и показатель степени, и программа вычисляет степень числа.
   Степень, это умножение числа самого на себя.
   Основание степени - это число, которое умножается само на себя.
   Показатель степени - это число, которое показывает, сколько раз основание умножается само на себя.
   Степень - это результат возведения в степень.
3. Вывести на экран таблицу ASCII-символов, по 16 символов в строке.
   Символы должны быть разделены одним пробелом.
4. С клавиатуры вводится число, и программа выводит на экран ряд Фибоначчи, до введенного числа.
   Ряд Фибоначчи можно построить из двух чисел 0 и 1, каждый следующий член ряда - это сумма двух предыдущих членов, например:
	0	1	1	2	3	5	8	13	 21
5. С клавиатуры вводится число, и программа выводит на экран заданное количество чисел из ряда Фибоначчи;

TODO:
https://ru.gecid.com/power/sovremennyee_bloki_pitaniya_atx_i_ih_harakteristiki/

TODO:
1. Написать программу "Калькулятор", которая вычисляет выражения вида:
	2 + 3;
2. Пользователь вводит число, а программа говорит, является ли это число палиндромом.
   Палиндром - это число, которое чистается одинаково, как слева направо, так и справа налево,
   например:
   12321
   1221
   121
   2
3. В Solution 'ControlStructures' добавить проект 'Shooter', и в этом проекте реализовать Shooter,
   который выводит на экран действие, согласно нажатой клавиши:
	w - вперед;
	s - назад;
	a - налево;
	d - направо;
	space - прыжок;
	enter - огонь;
	escape - выход;
   Если пользователь нажал не ту клавишу, на экран выводится 'Error'.

TODO:
Изучить шину USB:
1. Архитектура;
2. Разъемы;
3. Пропускные способности;
4. Версии стандарта;

DONE:
Повторить всю теорию по операторам и типам данных.

DONE:
В итернет-магазине Citilink или DNS (на Ваше усмотрение) выьрать материнскую плату с сокетом LGA-1700.
Бюджет не ограничен.

DONE:
Следующие задачи нужно решить без компилятора:
1. Что будет выведено на экран:
	int i = 3;
	i = ++i + ++i;
	cout << i << endl;
2. Что будет выведено на экран:
	int i = 3;
	i = i++ + ++i;
	cout << i << endl;
3. Что будет выведено на экран:
	int i = 3;
	i = i++ + 1 + ++i * 2;
	cout << i << endl;
4. Что будет выведено на экран:
	int i = 3;
	i = i++ + 1 + ++i *= 2;
	cout << i << endl;
5. Что будет выведено на экран:
	int i = 3;
	i += i++ + 1 + ++i *= 2;
	cout << i << endl;
6. Что будет выведено на экран:
	int i = 3;
	i *= i++ + 1 + ++i += 2;
	cout << i << endl;


TOREAD:
https://legacy.cplusplus.com/doc/tutorial/constants/
https://www.youtube.com/watch?v=R2fauhD8sgY

Фазы питания:
https://www.youtube.com/watch?v=EaWCnEf8mAE&t=247s

TODO:
1. https://www.chipdip.ru/info/import-ic-packages
2. !!! НЕ ПОВТОРЯЙТЕ ЭТОТ ТРЮК В ДОМАШНИХ УСЛОВИЯХ !!!
	https://www.chipdip.ru/info/import-ic-packages
	https://www.youtube.com/watch?v=XXs0I5kuoX4
	https://www.youtube.com/watch?v=rtWrRYzh45g
	https://www.youtube.com/watch?v=ZuzSx0HmpR0
	https://www.youtube.com/watch?v=kz08QeNjirI
	https://www.youtube.com/watch?v=9c8lqdr5UiM
	https://www.youtube.com/watch?v=3TkWiy837V4
	https://www.youtube.com/watch?v=sl0VrsXhDn4

DONE:
1. Используя программу AIDA-64 измерить производительность Cache-памяти своего CPU;
	https://www.aida64.com/downloads/NDMxOTNlNGY=
2. https://www.youtube.com/watch?v=KCpVW6OKPwA;
3. Что такое "Tick-Tack"?

TODO:
1. Повторяем всю теорию!!!
2. Решить все задачи из файла:
	https://github.com/okovtun/BV_319/blob/master/DataTypes/DataTypes/VariablesTask.pdf
	Если первая задача не получается, пропускаем ее и идем дальше.

TODO:
https://www.youtube.com/watch?v=G4lcA2d5m2E
https://www.youtube.com/watch?v=z0jQZxH7NgM

TODO:
Вывести в консоль объем занимаемой памяти и диапазон принимаемых значений для всех целочисленных типов данных,
таким образом, как это было сделано для 'int'.

TODO:
Пока учим теорию!!!
https://www.ixbt.com/cpu/x86-cpu-faq-2006.shtml
http://www.softelectro.ru/ieee754.html

DONE:
Используя Escape-последовательности вывести в консоль стишок "В лесу родилась Ёлочка".
Стишок должен быть выровнен по середине окна консоли, 
и его куплеты должны быть разделены пустой строкой.

TODO:
1. Выучить теорию!!!
2. Для каждого поколения памяти найти техпроцесс и напряжение питания микросхем;
3. Почитать:
	https://www.ixbt.com/mainboard/ddr2-rmma.shtml
	https://www.ixbt.com/mainboard/ddr3-rmma.shtml